Repository: yshialexandra/Optimizing_LLM_Chinese_Translation_through_Syntactic_Feature_Extraction_and_Representation_Editing
Catalog: yshibachlorpaper/Yiyan_tmx/G33B.tmx
Source language: en_us
Languages: zh_cn

source: Alexandr Solzhenitsyn - Biographical
zh_cn: 索尔仁尼琴自传

source: I was born at Kislovodsk on 11th December, 1918.
zh_cn: 我于1918年十一月十一日出生于Kislovodsk。

source: My father had studied philological subjects at Moscow University, but did not complete his studies, as he enlisted as a volunteer when war broke out in 1914.
zh_cn: 我的父亲曾经在莫斯科大学学习文献学，但是并没有毕业，那是由于在1914年战争爆发之后他参加了志愿者活动。

source: He became an artillery officer on the German front, fought throughout the war and died in the summer of 1918, six months before I was born.
zh_cn: 他后来成为了德国前线的一名炮兵军官，他自始自终都身处战争之中，并在1918年的夏季去世，那正是我出生前六个月。

source: I was brought up by my mother, who worked as a shorthand-typist, in the town of Rostov on the Don, where I spent the whole of my childhood and youth, leaving the grammar school there in 1936.
zh_cn: 我是由我的母亲一手带大的，她是一名速记打字员，工作并生活于位于Don的一个名叫Rostov的小镇，我的整个童年和青少年时期都生活于此，直到1936年我离开那里的文法学校为止。

source: Even as a child, without any prompting from others, I wanted to be a writer and, indeed, I turned out a good deal of the usual juvenilia.
zh_cn: 就算是在少年时期，在没有任何外界刺激的情况之下，我仍然想要成为一名作家，并且，我也实实在在的把自己的注意力转向了大量的阅读少年读物。

source: In the 1930s, I tried to get my writings published but I could not find anyone willing to accept my manuscripts.
zh_cn: 在整个1930年代，我不断地尝试着让我的作品发表或出版，但是我发现没有任何一个人愿意接受我的手稿。

source: I wanted to acquire a literary education, but in Rostov such an education that would suit my wishes was not to be obtained.
zh_cn: 我希望能够取得一次接受正规文学培训的机会，但是在Rostov，正合我意的课程却最终没有接受我的请求。

source: To move to Moscow was not possible, partly because my mother was alone and in poor health, and partly because of our modest circumstances.
zh_cn: 搬到莫斯科居住是不可能的，一部分原因是由于我母亲带着糟糕的健康状况一个人独自生活，而另一部分原因则源于我们那困顿的生活状况。

source: I therefore began to study at the Department of Mathematics at Rostov University, where it proved that I had considerable aptitude for mathematics.
zh_cn: 我之后便开始了在Rostov大学数学系的学习，在这里的学习培养了我在数学方面的重要才能。

source: But although I found it easy to learn this subject, I did not feel that I wished to devote my whole life to it.
zh_cn: 虽然于我而言学起数学来十分简单，但是我仍然不认为我应该在之后的人生之中献身于此。

source: Nevertheless, it was to play a beneficial role in my destiny later on, and on at least two occasions, it rescued me from death.
zh_cn: 不过，它在我之后的命运之中仍然扮演了十分有益的作用，而且在之后的至少两个场合之中，它将我从死亡线上拉了回来。

source: For I would probably not have survived the eight years in camps if I had not, as a mathematician, been transferred to a so-called sharashia, where I spent four years; and later, during my exile, I was allowed to teach mathematics and physics, which helped to ease my existence and made it possible for me to write.
zh_cn: 由于数学的帮助，我得以在经历了八年的隔离营生涯之后生还，先是作为一个数学家，被迁至一个所谓的“sharashia”，我在那儿生活了大约四年的时间。之后，在我的流放生涯之中，我被允许教授数学和物理，这使得我拥有了悠闲的生活，并为我的写作赢得了时间。

source: If I had had a literary education it is quite likely that I should not have survived these ordeals but would instead have been subjected to even greater pressures.
zh_cn: 如果我的专业是文学，那么情况很有可能是我很难从这些严酷的考验当中获救，并且还很有可能承受更大的压力。

source: Later on, it is true, I began to get some literary education as well; this was from 1939 to 1941, during which time, along with university studies in physics and mathematics, I also studied by correspondence at the Institute of History, Philosophy and Literature in Moscow.
zh_cn: 在进入大学之后，确实是这样，我参加了一些文学训练；那时1939至1941年间的事情，在这段时间里，我在学习物理和数学之余，也通过函授的形式在莫斯科的历史、哲学和文学学院学习。

source: In 1941, a few days before the outbreak of the war, I graduated from the Department of Physics and Mathematics at Rostov University. At the beginning of the war, owing to weak health, I was detailed to serve as a driver of horsedrawn vehicles during the winter of 1941-1942.
zh_cn: 1941年，正是战争爆发的前几天，我从Rostov大学的数学与物理系毕业，由于身体虚弱，我被分配去担当马拉运输工具（horsedrawn vehicles）的司机，并在1941—1942年间的整个冬季服务于这个岗位之上。

source: Later, because of my mathematical knowledge, I was transferred to an artillery school, from which, after a crash course, I passed out in November 1942.
zh_cn: 之后，由于我在数学上所掌握的知识，我被转到一家炮兵学校，在这所学校里，我通过了一期速成班的学习，并在1942年的十一月毕业。

source: Immediately after this I was put in command of an artillery-position-finding company, and in this capacity, served, without a break, right in the front line until I was arrested in February 1945.
zh_cn: 在这之后，我立刻就被投入到协作进行大炮定位寻找的指挥当中。在这期间，我不断地工作，奔忙于前线作战当中，直到1945年2月被捕。

source: This happened in East Prussia, a region which is linked with my destiny in a remarkable way.
zh_cn: 这发生在东普鲁士，一个以与众不同的方式联系着我的命运的地方。

source: As early as 1937, as a first-year student, I chose to write a descriptive essay on "The Samsonov Disaster" of 1914 in East Prussia and studied material on this; and in 1945 I myself went to this area (at the time of writing, autumn 1970, the book August 1914 has just been completed).
zh_cn: 早在1937年，作为一个一年级的学生，我曾写过一篇关于发生在1914年东普鲁士的“Samsonov灾难”（The Samsonov Disaster）的叙述性论文，并且研究了大量关于这一事件的材料；在之后的1945年，我亲自来到了这里（在学这篇文章的时候，1970年的秋天，新书《1914年八月》（August 1914 ）刚刚完成。

source: I was arrested on the grounds of what the censorship had found during the years 1944-45 in my correspondence with a school friend, mainly because of certain disrespectful remarks about Stalin, although we referred to him in disguised terms.
zh_cn: 我被逮捕是由于国家的监察机构发现在1944-1945年间我在与一位校友的通信当中对斯大林运用了一些特定的不尊敬的评论，虽然我们认为我们已经假装对他十分恭谨。

source: As a further basis for the "charge", there were used the drafts of stories and reflections which had been found in my map case.
zh_cn: 在进一步的指控当中，用到了在握的地图箱当中找到的故事草稿和一些草图。

source: These, however, were not sufficient for a "prosecution", and in July 1945 I was "sentenced" in my absence, in accordance with a procedure then frequently applied, after a resolution by the OSO (the Special Committee of the NKVD), to eight years in a detention camp (at that time this was considered a mild sentence).
zh_cn: 然而，由于证据不足我最终没有被起诉，在1945年的七月，在我缺席的情况下，按照一系列经常被法律系统运用到的程序，在OSO（内务人民委员会特别委员会）的确认之下，我被宣判为呆在隔离营里生活八年（在当时那种情况下，这一句话被反复斟酌，最后形成一个文雅而优美的句子）。

source: I served the first part of my sentence in several correctional work camps of mixed types (this kind of camp is described in the play, The Tenderfoot and the Tramp).
zh_cn: 我的判决中的第一部分是在混合营（这种隔离营应该用一出戏来形容，《新手与流氓》（The Tenderfoot and the Tramp））当中进行一些改造工作。

source: In 1946, as a mathematician, I was transferred to the group of scientific research institutes of the MVD-MOB (Ministry of Internal Affairs, Ministry of State Security). I spent the middle period of my sentence in such "SPECIAL PRISONS" (The First Circle).
zh_cn: 1946年，作为一名数学家，我被调往MVD-MOB（内政部，国家安全部）的科学研究协会这一群体当中，我用这八年期间的中间一部分生活于“特殊的监狱”（SPECIAL PRISONS；《第一圈》（The First Circle））当中。

source: In 1950 I was sent to the newly established "Special Camps" which were intended only for political prisoners.
zh_cn: 1950年，我被送到了新建立的“特殊隔离营”当中，它仅仅指倾向于接受政治犯。

source: In such a camp in the town of Ekibastuz in Kazakhstan (One Day in the Life of Ivan Denisovich), I worked as a miner, a bricklayer, and a foundryman.
zh_cn: 这座隔离营坐落于Kazakhstan的小镇Ekibastuz（《伊凡·杰尼索维奇的一天》（One Day in the Life of Ivan Denisovich）），我既是矿工，又是砖匠，还是铸造工。

source: There I contracted a tumour which was operated on, but the condition was not cured (its character was not established until later on).
zh_cn: 在那儿我开刀缩小了体内的肿瘤，但是在当时的情况之下我并未被治愈（它的性质在很长的一段时间内都没有被确诊）。

source: One month after I had served the full term of my eight-year sentence, there came, without any new judgement and even without a "resolution from the OSO", an administrative decision to the effect that I was not to be released but EXILED FOR LIFE to Kok-Terek (southern Kazakhstan).
zh_cn: 在我服刑期满一个月之后，在没有任何宣判甚至没有任何“OSO决议”的情况之下，一个行政决定下达到我的面前，大意是我将不会被释放，而是被流放到哈萨克斯坦南部。

source: This measure was not directed specially against me, but was a very usual procedure at that time.
zh_cn: 这一措施并不是有意针对我，但是在当时却是一项极为普遍的手段。

source: I served this exile from March 1953 (on March 5th, when Stalin's death was made public, I was allowed for the first time to go out without an escort) until June 1956. Here my cancer had developed rapidly, and at the end of 1953, I was very near death.
zh_cn: 我作为一名被流放者从1953年的三月一直服刑至1956年的六月（1953年三月五日，在斯大林逝世的消息正式对外发布的之后，我第一次被允许在没有守卫的情况下外出活动），在这里我的癌症病情发展得很快，直到1953年底，我已经走到了死亡的边缘之上。

source: I was unable to eat, I could not sleep and was severely affected by the poisons from the tumour.
zh_cn: 我既无法吃饭，也无法进入梦乡，我的肌体受到了癌症极为严重而紧迫的戕害。

source: However, I was able to go to a cancer clinic at Tashkent, where, during 1954, I was cured (The Cancer Ward, Right Hand).
zh_cn: 不过呢，我被允许造访Tashkent的一家癌症诊所，在那儿，通过1954年整整一年的治疗，我最终被治愈了（“The Cancer Ward, Right Hand”）。

source: During all the years of exile, I taught mathematics and physics in a primary school and during my hard and lonely existence I wrote prose in secret (in the camp I could only write down poetry from memory).
zh_cn: 在我的整个流放生涯之中，我一直在当地的一家小学中教授数学和物理，为了度过那艰难而单调的生活，我一直悄悄的创作散文（在隔离营里，我只被允许通过记忆默写下某些诗歌）。

source: I managed, however, to keep what I had written, and to take it with me to the European part of the country, where, in the same way, I continued, as far as the outer world was concerned, to occupy myself with teaching and, in secret, to devote myself to writing, at first in the Vladimir district (Matryona's Farm) and afterwards in Ryazan.
zh_cn: 然而，我不懈的努力，不过是为了留下我所写下的稿件，并且带着它们，在这个国家的欧洲部分游历，在这里，我依然以同样的方式写作，描写那些所能涉及到的外部世界，很快就替代了教学，在秘密的写作之中，我决心投身于写作，开始是在Vladimir地区（Matryona's Farm），之后是在Ryazan。

source: During all the years until 1961, not only was I convinced that I should never see a single line of mine in print in my lifetime, but, also, I scarcely dared allow any of my close acquaintances to read anything I had written because I feared that this would become known.
zh_cn: 在那之后直到1961年，我不仅认为在我的有生之年我不会看到我的任何作品出版，而且，我不敢将我所写作的任何一个字拿给我的熟人阅读，因为我十分害怕这些作品再次被不该知道的人所得知。

source: Finally, at the age of 42, this secret authorship began to wear me down.
zh_cn: 最后，在我42岁那年，这些作品终于将我压垮了。

source: The most difficult thing of all to bear was that I could not get my works judged by people with literary training.
zh_cn: 最让我感觉到难受的是我无法将我的作品拿给那些受到过文学训练的人们评判。

source: In 1961, after the 22nd Congress of the U.S.S.R. Communist Party and Tvardovsky's speech at this, I decided to emerge and to offer One Day in the Life of Ivan Denisovich.
zh_cn: 1961年，在苏联共产党第22界代表大会和Tvardovsky的讲话之后，我决定拿出作品《伊凡·杰尼索维奇的一天》（One Day in the Life of Ivan Denisovich）出版。

source: Such an emergence seemed, then, to me, and not without reason, to be very risky because it might lead to the loss of my manuscripts, and to my own destruction.
zh_cn: 这样的决定，在那时，对于我而言，似乎是毫无理由的，但与此同时却是极其危险的，同时会将我本人带向毁灭。

source: But, on that occasion, things turned out successfully, and after protracted efforts, A.T. Tvardovsky was able to print my novel one year later.
zh_cn: 但是，在那种情况之下，事情变得顺利起来，几经拖延之后，A.T. Tvardovsky最终在一年之后得以出版我的作品。

source: The printing of my work was, however, stopped almost immediately and the authorities stopped both my plays and (in 1964) the novel, The First Circle, which, in 1965, was seized together with my papers from the past years.
zh_cn: 不过，我的作品几乎是一经面世就被当局叫停，同时被叫停的还有我的戏剧和小说（1964年），《第一圈》（The First Circle），在之后的1965年，我之前的作品被集中了起来不再流通。

source: During these months it seemed to me that I had committed an unpardonable mistake by revealing my work prematurely and that because of this I should not be able to carry it to a conclusion.
zh_cn: 在这几个月期间，我似乎被一种不可饶恕的错误所拖累，那就是我过早的拿出了我的作品，因此我也不可能得到什么好结果。

source: It is almost always impossible to evaluate at the time events which you have already experienced, and to understand their meaning with the guidance of their effects.
zh_cn: 我们几乎永远不可能为那段时期所经历的一切做出评价，也几乎不可能在完全没有引导的情况之下清楚的了解他们的影响。

source: All the more unpredictable and surprising to us will be the course of future events.
zh_cn: 所有的那些更加不可预知的和让人惊奇的事情都包含在未来所发生的一切当中。
